vvpai9/LPC1768-Motor-Safety-Interlock/Keil_v4/ARM/INC/ADI/ADuC7021.inc
T_T3LD                         EQU       T3LD      -T3BASE    
T_T3VAL                        EQU       T3VAL     -T3BASE    
T_T3CON                        EQU       T3CON     -T3BASE    
T_T3CLRI                       EQU       T3CLRI    -T3BASE    

T3LD_OFFSET                    EQU       0x0360
T3VAL_OFFSET                   EQU       0x0364
T3CON_OFFSET                   EQU       0x0368
T3CLRI_OFFSET                  EQU       0x036C

; PLL AND OSCILLATOR CONTROL

PLLBASE                        EQU       0xFFFF0400
PLLSTA                         EQU       0xFFFF0400
POWKEY1                        EQU       0xFFFF0404
POWCON                         EQU       0xFFFF0408
POWKEY2                        EQU       0xFFFF040C
PLLKEY1                        EQU       0xFFFF0410
PLLCON                         EQU       0xFFFF0414
PLLKEY2                        EQU       0xFFFF0418
Z_PLLSTA                       EQU       PLLSTA    -Z_BASE
Z_POWKEY1                      EQU       POWKEY1   -Z_BASE
Z_POWCON                       EQU       POWCON    -Z_BASE
Z_POWKEY2                      EQU       POWKEY2   -Z_BASE
Z_PLLKEY1                      EQU       PLLKEY1   -Z_BASE
Z_PLLCON                       EQU       PLLCON    -Z_BASE
Z_PLLKEY2                      EQU       PLLKEY2   -Z_BASE

T_PLLSTA                       EQU       PLLSTA    -PLLBASE   
T_POWKEY1                      EQU       POWKEY1   -PLLBASE   
T_POWCON                       EQU       POWCON    -PLLBASE   
T_POWKEY2                      EQU       POWKEY2   -PLLBASE   
T_PLLKEY1                      EQU       PLLKEY1   -PLLBASE   
T_PLLCON                       EQU       PLLCON    -PLLBASE   
T_PLLKEY2                      EQU       PLLKEY2   -PLLBASE   

PLLSTA_OFFSET                  EQU       0x0400
POWKEY1_OFFSET                 EQU       0x0404
POWCON_OFFSET                  EQU       0x0408
POWKEY2_OFFSET                 EQU       0x040C
PLLKEY1_OFFSET                 EQU       0x0410
PLLCON_OFFSET                  EQU       0x0414
PLLKEY2_OFFSET                 EQU       0x0418

; POWER SUPPLY MONITOR

PSMBASE                        EQU       0xFFFF0440
PSMCON                         EQU       0xFFFF0440
CMPCON                         EQU       0xFFFF0444
Z_PSMCON                       EQU       PSMCON    -Z_BASE
Z_CMPCON                       EQU       CMPCON    -Z_BASE

T_PSMCON                       EQU       PSMCON    -PSMBASE   
T_CMPCON                       EQU       CMPCON    -PSMBASE   

PSMCON_OFFSET                  EQU       0x0440
CMPCON_OFFSET                  EQU       0x0444

; Band Gap Reference

REFBASE                        EQU       0xFFFF0480
REFCON                         EQU       0xFFFF048C
Z_REFCON                       EQU       REFCON    -Z_BASE

T_REFCON                       EQU       REFCON    -REFBASE   

REFCON_OFFSET                  EQU       0x048C

; ADC INTERFACE REGISTERS

ADCBASE                        EQU       0xFFFF0500
ADCCON                         EQU       0xFFFF0500
ADCCP                          EQU       0xFFFF0504
ADCCN                          EQU       0xFFFF0508
ADCSTA                         EQU       0xFFFF050C
ADCDAT                         EQU       0xFFFF0510
ADCRST                         EQU       0xFFFF0514
ADCGN                          EQU       0xFFFF0530
ADCOF                          EQU       0xFFFF0534
Z_ADCCON                       EQU       ADCCON    -Z_BASE
Z_ADCCP                        EQU       ADCCP     -Z_BASE
Z_ADCCN                        EQU       ADCCN     -Z_BASE
Z_ADCSTA                       EQU       ADCSTA    -Z_BASE
Z_ADCDAT                       EQU       ADCDAT    -Z_BASE
Z_ADCRST                       EQU       ADCRST    -Z_BASE
Z_ADCGN                        EQU       ADCGN     -Z_BASE
Z_ADCOF                        EQU       ADCOF     -Z_BASE

T_ADCCON                       EQU       ADCCON    -ADCBASE   
T_ADCCP                        EQU       ADCCP     -ADCBASE   
T_ADCCN                        EQU       ADCCN     -ADCBASE   
T_ADCSTA                       EQU       ADCSTA    -ADCBASE   
T_ADCDAT                       EQU       ADCDAT    -ADCBASE   
T_ADCRST                       EQU       ADCRST    -ADCBASE   
T_ADCGN                        EQU       ADCGN     -ADCBASE   
T_ADCOF                        EQU       ADCOF     -ADCBASE   

ADCCON_OFFSET                  EQU       0x0500
ADCCP_OFFSET                   EQU       0x0504
ADCCN_OFFSET                   EQU       0x0508
ADCSTA_OFFSET                  EQU       0x050C
ADCDAT_OFFSET                  EQU       0x0510
ADCRST_OFFSET                  EQU       0x0514
ADCGN_OFFSET                   EQU       0x0530
ADCOF_OFFSET                   EQU       0x0534

; DAC INTERFACE REGISTERS

DACBASE                        EQU       0xFFFF0600
DAC0CON                        EQU       0xFFFF0600
DAC0DAT                        EQU       0xFFFF0604
DAC1CON                        EQU       0xFFFF0608
DAC1DAT                        EQU       0xFFFF060C
Z_DAC0CON                      EQU       DAC0CON   -Z_BASE
Z_DAC0DAT                      EQU       DAC0DAT   -Z_BASE
Z_DAC1CON                      EQU       DAC1CON   -Z_BASE
Z_DAC1DAT                      EQU       DAC1DAT   -Z_BASE

T_DAC0CON                      EQU       DAC0CON   -DACBASE   
T_DAC0DAT                      EQU       DAC0DAT   -DACBASE   
T_DAC1CON                      EQU       DAC1CON   -DACBASE   
T_DAC1DAT                      EQU       DAC1DAT   -DACBASE   

DAC0CON_OFFSET                 EQU       0x0600
DAC0DAT_OFFSET                 EQU       0x0604
DAC1CON_OFFSET                 EQU       0x0608
DAC1DAT_OFFSET                 EQU       0x060C

; 450 COMPATIABLE UART CORE REGISTERS

UARTBASE                       EQU       0xFFFF0700
COMTX                          EQU       0xFFFF0700
COMRX                          EQU       0xFFFF0700
COMDIV0                        EQU       0xFFFF0700
COMIEN0                        EQU       0xFFFF0704
COMDIV1                        EQU       0xFFFF0704
COMIID0                        EQU       0xFFFF0708
COMCON0                        EQU       0xFFFF070C
COMCON1                        EQU       0xFFFF0710
COMSTA0                        EQU       0xFFFF0714
COMSTA1                        EQU       0xFFFF0718
COMSCR                         EQU       0xFFFF071C
COMIEN1                        EQU       0xFFFF0720
COMIID1                        EQU       0xFFFF0724
COMADR                         EQU       0xFFFF0728
COMDIV2                        EQU       0xFFFF072C
Z_COMTX                        EQU       COMTX     -Z_BASE
Z_COMRX                        EQU       COMRX     -Z_BASE
Z_COMDIV0                      EQU       COMDIV0   -Z_BASE
Z_COMIEN0                      EQU       COMIEN0   -Z_BASE
Z_COMDIV1                      EQU       COMDIV1   -Z_BASE
Z_COMIID0                      EQU       COMIID0   -Z_BASE
Z_COMCON0                      EQU       COMCON0   -Z_BASE
Z_COMCON1                      EQU       COMCON1   -Z_BASE
Z_COMSTA0                      EQU       COMSTA0   -Z_BASE
Z_COMSTA1                      EQU       COMSTA1   -Z_BASE
Z_COMSCR                       EQU       COMSCR    -Z_BASE
Z_COMIEN1                      EQU       COMIEN1   -Z_BASE
Z_COMIID1                      EQU       COMIID1   -Z_BASE
Z_COMADR                       EQU       COMADR    -Z_BASE
Z_COMDIV2                      EQU       COMDIV2   -Z_BASE

