vvpai9/LPC1768-Motor-Safety-Interlock/Keil_v4/ARM/INC/ADI/ADuC7021.inc
; GPIO AND SERIAL PORT MUX

GPIOBASE                       EQU       0xFFFFF400
GP0CON                         EQU       0xFFFFF400
GP1CON                         EQU       0xFFFFF404
GP2CON                         EQU       0xFFFFF408
GP3CON                         EQU       0xFFFFF40C
GP4CON                         EQU       0xFFFFF410
GP0DAT                         EQU       0xFFFFF420
GP0SET                         EQU       0xFFFFF424
GP0CLR                         EQU       0xFFFFF428
GP0PAR                         EQU       0xFFFFF42C
GP1DAT                         EQU       0xFFFFF430
GP1SET                         EQU       0xFFFFF434
GP1CLR                         EQU       0xFFFFF438
GP1PAR                         EQU       0xFFFFF43C
GP2DAT                         EQU       0xFFFFF440
GP2SET                         EQU       0xFFFFF444
GP2CLR                         EQU       0xFFFFF448
GP3DAT                         EQU       0xFFFFF450
GP3SET                         EQU       0xFFFFF454
GP3CLR                         EQU       0xFFFFF458
GP3PAR                         EQU       0xFFFFF45C
GP4DAT                         EQU       0xFFFFF460
GP4SET                         EQU       0xFFFFF464
GP4CLR                         EQU       0xFFFFF468
Z_GP0CON                       EQU       GP0CON    -Z_BASE
Z_GP1CON                       EQU       GP1CON    -Z_BASE
Z_GP2CON                       EQU       GP2CON    -Z_BASE
Z_GP3CON                       EQU       GP3CON    -Z_BASE
Z_GP4CON                       EQU       GP4CON    -Z_BASE
Z_GP0DAT                       EQU       GP0DAT    -Z_BASE
Z_GP0SET                       EQU       GP0SET    -Z_BASE
Z_GP0CLR                       EQU       GP0CLR    -Z_BASE
Z_GP0PAR                       EQU       GP0PAR    -Z_BASE
Z_GP1DAT                       EQU       GP1DAT    -Z_BASE
Z_GP1SET                       EQU       GP1SET    -Z_BASE
Z_GP1CLR                       EQU       GP1CLR    -Z_BASE
Z_GP1PAR                       EQU       GP1PAR    -Z_BASE
Z_GP2DAT                       EQU       GP2DAT    -Z_BASE
Z_GP2SET                       EQU       GP2SET    -Z_BASE
Z_GP2CLR                       EQU       GP2CLR    -Z_BASE
Z_GP3DAT                       EQU       GP3DAT    -Z_BASE
Z_GP3SET                       EQU       GP3SET    -Z_BASE
Z_GP3CLR                       EQU       GP3CLR    -Z_BASE
Z_GP3PAR                       EQU       GP3PAR    -Z_BASE
Z_GP4DAT                       EQU       GP4DAT    -Z_BASE
Z_GP4SET                       EQU       GP4SET    -Z_BASE
Z_GP4CLR                       EQU       GP4CLR    -Z_BASE

T_GP0CON                       EQU       GP0CON    -GPIOBASE  
T_GP1CON                       EQU       GP1CON    -GPIOBASE  
T_GP2CON                       EQU       GP2CON    -GPIOBASE  
T_GP3CON                       EQU       GP3CON    -GPIOBASE  
T_GP4CON                       EQU       GP4CON    -GPIOBASE  
T_GP0DAT                       EQU       GP0DAT    -GPIOBASE  
T_GP0SET                       EQU       GP0SET    -GPIOBASE  
T_GP0CLR                       EQU       GP0CLR    -GPIOBASE  
T_GP0PAR                       EQU       GP0PAR    -GPIOBASE  
T_GP1DAT                       EQU       GP1DAT    -GPIOBASE  
T_GP1SET                       EQU       GP1SET    -GPIOBASE  
T_GP1CLR                       EQU       GP1CLR    -GPIOBASE  
T_GP1PAR                       EQU       GP1PAR    -GPIOBASE  
T_GP2DAT                       EQU       GP2DAT    -GPIOBASE  
T_GP2SET                       EQU       GP2SET    -GPIOBASE  
T_GP2CLR                       EQU       GP2CLR    -GPIOBASE  
T_GP3DAT                       EQU       GP3DAT    -GPIOBASE  
T_GP3SET                       EQU       GP3SET    -GPIOBASE  
T_GP3CLR                       EQU       GP3CLR    -GPIOBASE  
T_GP3PAR                       EQU       GP3PAR    -GPIOBASE  
T_GP4DAT                       EQU       GP4DAT    -GPIOBASE  
T_GP4SET                       EQU       GP4SET    -GPIOBASE  
T_GP4CLR                       EQU       GP4CLR    -GPIOBASE  

GP0CON_OFFSET                  EQU       0x0400
GP1CON_OFFSET                  EQU       0x0404
GP2CON_OFFSET                  EQU       0x0408
GP3CON_OFFSET                  EQU       0x040C
GP4CON_OFFSET                  EQU       0x0410
GP0DAT_OFFSET                  EQU       0x0420
GP0SET_OFFSET                  EQU       0x0424
GP0CLR_OFFSET                  EQU       0x0428
GP0PAR_OFFSET                  EQU       0x042C
GP1DAT_OFFSET                  EQU       0x0430
GP1SET_OFFSET                  EQU       0x0434
GP1CLR_OFFSET                  EQU       0x0438
GP1PAR_OFFSET                  EQU       0x043C
GP2DAT_OFFSET                  EQU       0x0440
GP2SET_OFFSET                  EQU       0x0444
GP2CLR_OFFSET                  EQU       0x0448
GP3DAT_OFFSET                  EQU       0x0450
GP3SET_OFFSET                  EQU       0x0454
GP3CLR_OFFSET                  EQU       0x0458
GP3PAR_OFFSET                  EQU       0x045C
GP4DAT_OFFSET                  EQU       0x0460
GP4SET_OFFSET                  EQU       0x0464
GP4CLR_OFFSET                  EQU       0x0468

; FLASH CONTROL INTERFACE

FLASHBASE                      EQU       0xFFFFF800
FEESTA                         EQU       0xFFFFF800
FEEMOD                         EQU       0xFFFFF804
FEECON                         EQU       0xFFFFF808
FEEDAT                         EQU       0xFFFFF80C
FEEADR                         EQU       0xFFFFF810
FEESIGN                        EQU       0xFFFFF818
FEEPRO                         EQU       0xFFFFF81C
FEEHIDE                        EQU       0xFFFFF820
Z_FEESTA                       EQU       FEESTA    -Z_BASE
Z_FEEMOD                       EQU       FEEMOD    -Z_BASE
Z_FEECON                       EQU       FEECON    -Z_BASE
Z_FEEDAT                       EQU       FEEDAT    -Z_BASE
Z_FEEADR                       EQU       FEEADR    -Z_BASE
Z_FEESIGN                      EQU       FEESIGN   -Z_BASE
Z_FEEPRO                       EQU       FEEPRO    -Z_BASE
Z_FEEHIDE                      EQU       FEEHIDE   -Z_BASE

T_FEESTA                       EQU       FEESTA    -FLASHBASE 
T_FEEMOD                       EQU       FEEMOD    -FLASHBASE 
T_FEECON                       EQU       FEECON    -FLASHBASE 
T_FEEDAT                       EQU       FEEDAT    -FLASHBASE 
T_FEEADR                       EQU       FEEADR    -FLASHBASE 
T_FEESIGN                      EQU       FEESIGN   -FLASHBASE 
T_FEEPRO                       EQU       FEEPRO    -FLASHBASE 
T_FEEHIDE                      EQU       FEEHIDE   -FLASHBASE 

FEESTA_OFFSET                  EQU       0x0800
FEEMOD_OFFSET                  EQU       0x0804
FEECON_OFFSET                  EQU       0x0808
FEEDAT_OFFSET                  EQU       0x080C
FEEADR_OFFSET                  EQU       0x0810
FEESIGN_OFFSET                 EQU       0x0818
FEEPRO_OFFSET                  EQU       0x081C
FEEHIDE_OFFSET                 EQU       0x0820
